{"data":{"site":{"siteMetadata":{"title":"Christian Brevik","author":"Christian Brevik"}},"markdownRemark":{"id":"abbf04bd-1ea7-58da-8c60-2c67da41cb51","excerpt":"The news that broke a couple of days ago about the  -bug that occurs in the newly released iOS 12 was  a bit  scary. I first learnt about it…","html":"<p>The news that broke a couple of days ago about the <code class=\"language-text\">Array.reverse</code>-bug that occurs in the newly released iOS 12 was <em>a bit</em> scary. I first learnt about it from <a href=\"https://stackoverflow.com/questions/52390368/array-state-will-be-cached-in-ios-12-safari-is-it-a-bug-or-feature/\">this Stack Overflow-post</a> by way of <a href=\"https://news.ycombinator.com/item?id=18021835\">Hacker News</a>.</p>\n<p>Developers have experienced a JavaScript-bug in Safari iOS 12, where an <code class=\"language-text\">Array.reverse</code> will cache the <code class=\"language-text\">Array</code> value state, which will still remain reversed even if you reload the page. I think most developers will understand why that is a problem. And apparently the same error exists on macOS as well, not just iOS.</p>\n<p>After researching it a bit more, I found that it’s a bit misleading to call it a “Safari bug” though, because the <a href=\"https://bugs.webkit.org/show_bug.cgi?id=188794\">WebKit bug report</a> suggests that it actually exists in the <code class=\"language-text\">JavaScriptCore</code>-framework. Having contributed a bit to the React Native (RN) framework, I quickly noticed that this might be trouble. Because the RN JavaScript-bundle actually runs inside the <code class=\"language-text\">JavaScriptCore</code>-framework on iOS!</p>\n<p>I am currently working at <a href=\"https://www.ice.no/\">Ice</a> (the Norwegian mobile operator) on their app, which is made with RN, and knew I had to look into this right away.</p>\n<p><strong>What I found is that everyone who upgrades to iOS 12 on their device, will experience this bug with React Native-apps they have installed.</strong></p>\n<p>So RN-developers should start getting a <strong>little</strong> worried.</p>\n<h1>Demonstrating the bug</h1>\n<p>I have made an <a href=\"https://github.com/cbrevik/arrayReverseBug\">example app</a> to demonstrate that this bug will occur in RN-apps as well:</p>\n<p><img src=\"/content/images/2018/09/red-1.png\" alt=\"The Array.reverse bug inside a React Native-app\"></p>\n<p>It is important to note here that if you have the RN remote debugger attached, this bug will not occur. This is because the remote debugger runs the JS-bundle inside of the Chrome-debugger.</p>\n<p>Now your gut reaction may be to run to your codebases and search for “Array.reverse”, and manually fix it in all those locations. But remember that any dependencies you use will also experience the same bug. This might lead to some really subtle bugs that will be difficult to debug.</p>\n<h1>Fixing the bug</h1>\n<p>Of course, this being the JavaScript-community, someone has already released a <a href=\"https://www.npmjs.com/package/array-reverse-polyfill\">polyfill for this bug</a>. You can install this package with:</p>\n<p><code class=\"language-text\">yarn add array-reverse-polyfill</code></p>\n<p>And then include it up top in your root <code class=\"language-text\">index.js</code> file:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">import &quot;array-reverse-polyfill&quot;;\nimport { AppRegistry } from &quot;react-native&quot;;\nimport App from &quot;./App&quot;;\nimport { name as appName } from &quot;./app.json&quot;;\n\nAppRegistry.registerComponent(appName, () =&gt; App);</code></pre></div>\n<p>This will override the <code class=\"language-text\">Array.prototype.reverse</code> with a fixed version, if the original version is found to be buggy:</p>\n<p><img src=\"/content/images/2018/09/fixed.png\" alt=\"fixed\"></p>\n<p>If you only want to apply this fix for devices running iOS 12, you could do something like this instead:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">import { Platform } from &quot;react-native&quot;;\nif (Platform.Version === &quot;12.0&quot;) {\n  require(&quot;array-reverse-polyfill&quot;);\n}</code></pre></div>\n<p>It’s important to say that I have not published any apps with this fix to the AppStore, and you should carefully test your apps if you want to apply this fix.</p>\n<h1>Outro</h1>\n<p>On a personal note, I think “just” applying fixes like this is going down the wrong road. If we have to manually polyfill for every little bug, then we’re reverting back to practices which were not productive to begin with. I believe it is a good idea to encourage people to upgrade to a version of iOS that fixes the problem, since it is a global bug which can affect many other apps.</p>\n<p>But of course, if this bug causes major problems in your app, a quick fix is better than nothing.</p>\n<p>It is important to note that this will also occur in other frameworks or apps using <code class=\"language-text\">JavaScriptCore</code>, which includes Chrome on iOS, and <code class=\"language-text\">WebViews</code> which native apps are displaying, etc.</p>\n<p><a href=\"https://github.com/cbrevik/arrayReverseBug\">Check out the example code here</a> if you want to test for yourself.</p>","frontmatter":{"title":"React Native and the Array.reverse bug","date":"September 21, 2018"}}},"pageContext":{"slug":"/2018-09-21-react-native-and-the-array-reverse-bug/","previous":{"fields":{"slug":"/2018-03-08-your-first-vs-code-extension/"},"frontmatter":{"title":"Your first VS Code extension"}},"next":null}}